Repository: synctext/TaarifaTraders
Catalog: app/po/ch_MW.po
Languages: ch_mw

source: Charter for Cross-Border Trade in Goods and Services
ch_mw: Hayala kwa Cross-Border Trade mu katundu ndi Services

source: Online platform for reported issues
ch_mw: Online nsanja nkhani inati

source: Issues Reported
ch_mw: Kunyumba

source: Subscribers
ch_mw: Makasitomala

source: Issues
ch_mw: Madandaulo

source: Add Issue
ch_mw: Kuonjezera dandaulo

source: Dashboard
ch_mw: Bolodi

source: REMARKS
ch_mw: NDEMANGA

source: PHONE NUMBER
ch_mw: NAMBALA YA LAMYA

source: SUBSCRIBED
ch_mw: KOLEMBETSELA

source: DESCRIPTION
ch_mw: MAONEKENDWE

source: SUBSCRIBED AT
ch_mw: KOLEMBETSELA

source: STATUS
ch_mw: MMENE ZILIRI

source: Search
ch_mw: Kusaka

source: REGISTRATION
ch_mw: KULEMBETSA

source: This user has been successfully registered with the system.
ch_mw: wosuta yakhala bwinobwino mayina ndi dongosolo.

source: CODE
ch_mw: NAMBALA

source: ISSUE
ch_mw: DANDAULO

source: DATE
ch_mw: TSIKU
